Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new instance of load classification and adds it to the document.
ADoc:
The document where the element will be created and added.
strName:
The name of the electrical load classification to be created.
Returns:
The newly created load classification element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.ActualElectricalLoadLabel
The name template for the actual load parameter on the load classification.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: actualElectricalLoadLabel is not a valid globalization format string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.PanelEstimatedCurrentLabel
The name template for the estimated current parameter on the load classification.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: panelEstimatedCurrentLabel is not a valid globalization format string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.PanelConnectedCurrentLabel
The name template for the connected current parameter on the load classification.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: panelConnectedCurrentLabel is not a valid globalization format string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.PanelEstimatedLabel
The name template for the estimated demand parameter on the load classification.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: panelEstimatedLabel is not a valid globalization format string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.PanelConnectedLabel
The name template for the connected load parameter of the load classification.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: panelConnectedLabel is not a valid globalization format string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.LoadSummaryDemandFactorLabel
The name template for the demand factor parameter of the load classification.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: loadSummaryDemandFactorLabel is not a valid globalization format string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.Motor
Indicates if this load classification is to be used for motors.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.SpaceLoadClass
The electrical load class associated with a space.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.DemandFactorId
The demand factor definition this load classification element uses.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element id elemId is not a valid ElectricalDemandFactorDefinition element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalLoadClassification
The ElectricalLoadClassification class represents a serialized version of an instance of
load classification.
Since:
2011